Revit 2027 API
ParameterTypeId.CouplerRotationAngle Property
 "Coupler Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerRotationAngle { get; }
Public Shared ReadOnly Property CouplerRotationAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerRotationAngle {
	ForgeTypeId^ get ();
}
static member CouplerRotationAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace